<table width=90% bgcolor=white>
<tr valign=top><td valign=top>
<big><font color="#444444"><b>ミスしてページを変えたりウインドウを消してしまったりした場合は落ちついて同じキャンバスの幅で編集ページを開きなおしてみて下さい。大抵は残っています。<br>
（WinIEやネスケ6.1の短縮起動機能が使えないブラウザは閉じると消えます）<br><br></b></font></big>
<font color="#666666"><b>基本の動作(恐らくこれだけは覚えておいた方が良い機能)</b></font><br>
<font color="#808080"><b>&lt;基本&gt;</b></font><br>
PaintBBSでは右クリック,ctrl+クリック,alt+クリックは同じ動作をします。<br>
基本的に操作は一回のクリックか右クリックで動作が完了します。(ベジエやコピー使用時を除く)<br>
<br>
<font color="#808080"><b>&lt;ツールバー&gt;</b></font><br>
ツールバーの殆どのボタンは複数回クリックして機能を切り替える事が出来ます。<br>
右クリックで逆周り。その他パレットの色,マスクの色,一字保存ツールに現在の状態を登録,レイヤ表示非表示切り替え等全て右クリックです。<br>
逆にクリックでパレットの色と一時保存ツールに保存しておいた状態を取り出せます。<br>
<br>
<font color="#808080"><b>&lt;キャンバス部分&gt;</b></font><br>
右クリックで色をスポイトします<br>
ベジエやコピー等の処理の途中で右クリックを押すとリセットします。<br>
<br>
<font color="#666666"><b>特殊動作(使う必要は無いが慣れれば便利な機能)</b></font><br>
<font color="#808080"><b>&lt;ツールバー&gt;</b></font><br>
値を変更するバーはドラッグ時バーの外に出した場合変化が緩やかになりますのでそれを利用して細かく変更する事が出来ます。<br>
パレットはShift+クリックで色をデフォルトの状態に戻します。<br>
<br>
<font color="#808080"><b>&lt;キーボードのショートカット&gt;</b></font><br>
+で拡大-で縮小。<br>
Ctrl+ZかCtrl+Uで元に戻す、Ctrl+Alt+ZかCtrl+Yでやり直し。<br>
Escでコピーやベジエのリセット。（右クリックでも同じ） <br>
スペースキーを押しながらキャンバスをドラッグするとスクロールの自由移動。<br>
Ctrl+Alt+ドラッグで線の幅を変更。<br>
<br>
<font color="#808080"><b>&lt;コピーツールの特殊な利用方法&gt;</b></font><br>
レイヤー間の移動は現時点ではコピーとレイヤー結合のみです。<br>
コピーでの移動方法は、まず移動したいレイヤ上の長方形を選択後、移動させたいレイヤを選択後に通常のコピーの作業を続けます。<br>
そうする事によりレイヤ間の移動が可能になります。<br>
<br>
<font color="#666666"><b>ツールバーのボタンと特殊な機能の簡単な説明</b></font>
<ul type="Circle">
<li>ペン先(通常ペン,水彩ペン,テキスト)<br><font color="444444">メインのフリーライン系のペンとテキスト</font><br><br></li>
<li>ペン先2(トーン,ぼかし,他)<br><font color="444444">特殊な効果を出すフリーライン系のペン</font><br><br></li>
<li>図形(円や長方形)<br><font color="444444">長方形や円等の図形</font><br><br></li>
<li>特殊(コピーやレイヤー結合,反転等)<br><font color="444444">コピーは一度選択後、ドラッグして移動、コピーさせるツールです。</font><br><br></li>
<li>マスクモード指定(通常,マスク,逆マスク）<br><font color="444444">マスクで登録されている色を描写不可にします。逆マスクはその逆。<br>
通常でマスク無し。また右クリックでマスクカラーの変更が可能。<br><br></font></li>
<li>消しゴム(消しペン,消し四角,全消し)<br><font color="444444">透過レイヤー上を白で塗り潰した場合、下のレイヤーが見えなくなりますので上位レイヤーの線を消す時にはこのツールで消す様にして下さい。<br>
全消しはすべてを透過ピクセル化させるツールです。<br>
全けしを利用する場合はこのツールを選択後キャンバスをクリックでOK。<br><br></font></li>
<li>描写方法の指定。(手書き,直線,ベジエ曲線)<br><font color="444444">ペン先,描写機能指定ではありません。<br>
また適用されるのはフリーライン系のツールのみです。</font><br><br></li>
<li>カラーパレット郡<br><font color="444444">クリックで色取得。右クリックで色の登録。Shift+クリックでデフォルト値。</font><br><br></li>
<li>RGBバーとalphaバー<br><font color="444444">細かい色の変更と透過度の変更。Rは赤,Gは緑,Bは青,Aは透過度を指します。<br>
トーンはAlphaバーで値を変更する事で密度の変更が可能です。</font><br><br></li>
<li>線幅変更ツール<br><font color="444444">水彩ペンを選択時に線幅を変更した時、デフォルトの値がalpha値に代入されます。</font><br><br></li>
<li>線一時保存ツール<br><font color="444444">クリックでデータ取得。右クリックでデータの登録。(マスク値は登録しません)</font><br><br></li>
<li>レイヤーツール<br><font color="444444">PaintBBSは透明なキャンバスを二枚重ねたような構造になっています。<br>
つまり主線を上に書き、色を下に描くと言う事も可能になるツールです。<br>
通常レイヤーと言う種類の物ですので鉛筆で描いたような線もキッチリ透過します。<br>
クリックでレイヤー入れ替え。右クリックで選択されているレイヤの表示、非表示切り替え。</font><br><br></li>
</ul>
<font color="#666666"><b>投稿に関して：</b></font>
絵が完成したら投稿ボタンで投稿します。<br>
絵の投稿が成功した場合は指定されたURLへジャンプします。<br>
失敗した場合は失敗したと報告するのみでどこにも飛びません。<br>
単に重かっただけである場合少し間を置いた後、再度投稿を試みて下さい。<br>
この際二重で投稿される場合があるかもしれませんが、それはWebサーバーかPHP側の処理ですのであしからず。
</td></tr>
</table>
